import random
from tkinter.tix import InputOnly
from module import *
import datetime
# # -------------------------------------------------
# # 0

# a=int(input("Введи первое число: "))
# b=int(input("Введи второе число: "))
# c=input("Введи третье число: ")

# vastus = summa3(a, b, int(c))
# print(vastus)

# #-------------------------------------------------
# #2

# aasta = int(input("Введи какой либо год:  "))
# result = is_year_leap(aasta)

# print(result)

# #-------------------------------------------------
# #3

# сторона = float(input("Введите размер стороны квадрата:  "))
# result = square(сторона)

# print(result)

# #-------------------------------------------------
# #5

# a = int(input("Введите размер вклада в евро:  ")) 
# years = int(input("На какой срок в годах вы вкладываетесь:  "))

# res = bank(a, years)
# print(f"У вас на счету через {years} лет будет {round(res)}")

#-------------------------------------------------
#4

numberm = str(input("Какой месяц хотите проверить? "))

res = season(numberm)

print(f"{res}")
#-------------------------------------------------
#1



#-------------------------------------------------
#6



#-------------------------------------------------
#7



#-------------------------------------------------
#8



